---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryAreaRestraintY
source: html/37d3a2e5-7457-09bd-a790-7137025d1a11.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryAreaRestraintY Property

"Y Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryAreaRestraintY { get; }
```